// <auto-generated/>
// Generated from apis.json - DO NOT EDIT MANUALLY
#pragma once

#include <cstdint>

namespace RayaTrainer::agent
{
#pragma pack(push, 1)
struct AgentGameApiGetThingClassRequest
{
    uint32_t UnitTypeId;
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiGetThingClassPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t UnitTypeId;
    uint32_t ThingClassAddress;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiReadSelectedUnitCodeRequest
{
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiSelectedUnitSnapshotPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t UnitTypeId;
    uint32_t ThingClassAddress;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiLevelUpSelectedRequest
{
    uint32_t Count;
    uint32_t Rank;
    uint32_t Flags;
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiLevelUpSelectedPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiCreateUnitRequest
{
    uint32_t ThingClassAddress;
    float PosX;
    float PosY;
    float PosZ;
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiCreateUnitPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t CreatedUnitAddress;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiKillUnitRequest
{
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiKillUnitPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiCopyForMeRequest
{
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiCopyForMePayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t CreatedUnitAddress;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiGetMeBaseRequest
{
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiGetMeBasePayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiWeNeedBackRequest
{
    uint32_t UnitTypeId;
    uint32_t Count;
    uint32_t Rank;
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiWeNeedBackPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiSetUnitStateRequest
{
    uint32_t StateFlags;
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiSetUnitStatePayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiGetCurrentPlayerRequest
{
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiGetCurrentPlayerPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t PlayerPointer;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiLookupScienceByHashRequest
{
    uint32_t Hash;
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiLookupScienceByHashPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t SciencePointer;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiGrantPlayerTechRequest
{
    uint32_t TechHash;
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiGrantPlayerTechPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiGrantUpgradeToPlayerRequest
{
    uint32_t UpgradeHash;
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiGrantUpgradeToPlayerPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiHasUpgradeRequest
{
    uint32_t UpgradeHash;
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiHasUpgradePayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t HasUpgrade;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiLookupTemplateByHashRequest
{
    uint32_t Hash;
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiLookupTemplateByHashPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t TemplatePointer;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiLookupUpgradeByHashRequest
{
    uint32_t Hash;
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiLookupUpgradeByHashPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t UpgradePointer;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiGrantSecretProtocolRequest
{
    uint32_t TechHash;
    uint32_t UpgradeHash;
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiGrantSecretProtocolPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiGrantSelectedUpgradeRequest
{
    uint32_t UpgradeHash;
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiGrantSelectedUpgradePayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiClearPlayerTechLocksRequest
{
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiClearPlayerTechLocksPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiSecretProtocolBindingProbeRequest
{
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiSecretProtocolBindingProbePayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t ProbeResult;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiReplaceTemplateModelRequest
{
    uint32_t TargetHash;
    uint32_t DonorHash;
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiReplaceTemplateModelPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiReplaceTemplateWeaponRequest
{
    uint32_t TargetHash;
    uint32_t DonorHash;
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiReplaceTemplateWeaponPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiSetSelectedStatusBitRequest
{
    uint32_t Domain;
    uint32_t BitIndex;
    uint32_t Enabled;
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiSetSelectedStatusBitPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiSetSelectedUnitHealthRequest
{
    uint32_t Mode;
    float Health;
    float MaxHealth;
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiSetSelectedUnitHealthPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiExpandProductionQueueRequest
{
    uint32_t MaxQueueEntries;
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiExpandProductionQueuePayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t ExpandedStructureCount;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiTeleportSelectedUnitsToMouseRequest
{
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiTeleportSelectedUnitsToMousePayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiSetSelectedUnitSpeedRequest
{
    uint32_t Mode;
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiSetSelectedUnitSpeedPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiCaptureSelectedUnitsRequest
{
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiCaptureSelectedUnitsPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiSetSelectedUnitAmmoRequest
{
    uint32_t Ammo;
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiSetSelectedUnitAmmoPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiToggleSelectedAttackSpeedRequest
{
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiToggleSelectedAttackSpeedPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiToggleSelectedAttackRangeRequest
{
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiToggleSelectedAttackRangePayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiClearSelectedAttackSpeedEffectsRequest
{
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiClearSelectedAttackSpeedEffectsPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

struct AgentGameApiClearSelectedAttackRangeEffectsRequest
{
    uint32_t TimeoutMilliseconds;
    uint32_t EnableDirectGameApi;
};

struct AgentGameApiClearSelectedAttackRangeEffectsPayload
{
    uint16_t StatusCode;
    uint16_t AgentVersion;
    uint32_t DispatchStatus;
    uint32_t RequestId;
    uint32_t GameThreadTickBefore;
    uint32_t GameThreadTickAfter;
};

#pragma pack(pop)

static_assert(sizeof(AgentGameApiGetThingClassRequest) == 12);
static_assert(sizeof(AgentGameApiGetThingClassPayload) == 28);
static_assert(sizeof(AgentGameApiReadSelectedUnitCodeRequest) == 8);
static_assert(sizeof(AgentGameApiSelectedUnitSnapshotPayload) == 28);
static_assert(sizeof(AgentGameApiLevelUpSelectedRequest) == 20);
static_assert(sizeof(AgentGameApiLevelUpSelectedPayload) == 20);
static_assert(sizeof(AgentGameApiCreateUnitRequest) == 24);
static_assert(sizeof(AgentGameApiCreateUnitPayload) == 24);
static_assert(sizeof(AgentGameApiKillUnitRequest) == 8);
static_assert(sizeof(AgentGameApiKillUnitPayload) == 20);
static_assert(sizeof(AgentGameApiCopyForMeRequest) == 8);
static_assert(sizeof(AgentGameApiCopyForMePayload) == 24);
static_assert(sizeof(AgentGameApiGetMeBaseRequest) == 8);
static_assert(sizeof(AgentGameApiGetMeBasePayload) == 20);
static_assert(sizeof(AgentGameApiWeNeedBackRequest) == 20);
static_assert(sizeof(AgentGameApiWeNeedBackPayload) == 20);
static_assert(sizeof(AgentGameApiSetUnitStateRequest) == 12);
static_assert(sizeof(AgentGameApiSetUnitStatePayload) == 20);
static_assert(sizeof(AgentGameApiGetCurrentPlayerRequest) == 8);
static_assert(sizeof(AgentGameApiGetCurrentPlayerPayload) == 24);
static_assert(sizeof(AgentGameApiLookupScienceByHashRequest) == 12);
static_assert(sizeof(AgentGameApiLookupScienceByHashPayload) == 24);
static_assert(sizeof(AgentGameApiGrantPlayerTechRequest) == 12);
static_assert(sizeof(AgentGameApiGrantPlayerTechPayload) == 20);
static_assert(sizeof(AgentGameApiGrantUpgradeToPlayerRequest) == 12);
static_assert(sizeof(AgentGameApiGrantUpgradeToPlayerPayload) == 20);
static_assert(sizeof(AgentGameApiHasUpgradeRequest) == 12);
static_assert(sizeof(AgentGameApiHasUpgradePayload) == 24);
static_assert(sizeof(AgentGameApiLookupTemplateByHashRequest) == 12);
static_assert(sizeof(AgentGameApiLookupTemplateByHashPayload) == 24);
static_assert(sizeof(AgentGameApiLookupUpgradeByHashRequest) == 12);
static_assert(sizeof(AgentGameApiLookupUpgradeByHashPayload) == 24);
static_assert(sizeof(AgentGameApiGrantSecretProtocolRequest) == 16);
static_assert(sizeof(AgentGameApiGrantSecretProtocolPayload) == 20);
static_assert(sizeof(AgentGameApiGrantSelectedUpgradeRequest) == 12);
static_assert(sizeof(AgentGameApiGrantSelectedUpgradePayload) == 20);
static_assert(sizeof(AgentGameApiClearPlayerTechLocksRequest) == 8);
static_assert(sizeof(AgentGameApiClearPlayerTechLocksPayload) == 20);
static_assert(sizeof(AgentGameApiSecretProtocolBindingProbeRequest) == 8);
static_assert(sizeof(AgentGameApiSecretProtocolBindingProbePayload) == 24);
static_assert(sizeof(AgentGameApiReplaceTemplateModelRequest) == 16);
static_assert(sizeof(AgentGameApiReplaceTemplateModelPayload) == 20);
static_assert(sizeof(AgentGameApiReplaceTemplateWeaponRequest) == 16);
static_assert(sizeof(AgentGameApiReplaceTemplateWeaponPayload) == 20);
static_assert(sizeof(AgentGameApiSetSelectedStatusBitRequest) == 20);
static_assert(sizeof(AgentGameApiSetSelectedStatusBitPayload) == 20);
static_assert(sizeof(AgentGameApiSetSelectedUnitHealthRequest) == 20);
static_assert(sizeof(AgentGameApiSetSelectedUnitHealthPayload) == 20);
static_assert(sizeof(AgentGameApiExpandProductionQueueRequest) == 12);
static_assert(sizeof(AgentGameApiExpandProductionQueuePayload) == 24);
static_assert(sizeof(AgentGameApiTeleportSelectedUnitsToMouseRequest) == 8);
static_assert(sizeof(AgentGameApiTeleportSelectedUnitsToMousePayload) == 20);
static_assert(sizeof(AgentGameApiSetSelectedUnitSpeedRequest) == 12);
static_assert(sizeof(AgentGameApiSetSelectedUnitSpeedPayload) == 20);
static_assert(sizeof(AgentGameApiCaptureSelectedUnitsRequest) == 8);
static_assert(sizeof(AgentGameApiCaptureSelectedUnitsPayload) == 20);
static_assert(sizeof(AgentGameApiSetSelectedUnitAmmoRequest) == 12);
static_assert(sizeof(AgentGameApiSetSelectedUnitAmmoPayload) == 20);
static_assert(sizeof(AgentGameApiToggleSelectedAttackSpeedRequest) == 8);
static_assert(sizeof(AgentGameApiToggleSelectedAttackSpeedPayload) == 20);
static_assert(sizeof(AgentGameApiToggleSelectedAttackRangeRequest) == 8);
static_assert(sizeof(AgentGameApiToggleSelectedAttackRangePayload) == 20);
static_assert(sizeof(AgentGameApiClearSelectedAttackSpeedEffectsRequest) == 8);
static_assert(sizeof(AgentGameApiClearSelectedAttackSpeedEffectsPayload) == 20);
static_assert(sizeof(AgentGameApiClearSelectedAttackRangeEffectsRequest) == 8);
static_assert(sizeof(AgentGameApiClearSelectedAttackRangeEffectsPayload) == 20);
}
